xizeyoupan/AT32F421K8T7-EIDE-template/.pack/ArteryTek/AT32F421_DFP.2.1.6/ArteryTek.AT32F421_DFP.pdsc
<?xml version="1.0" encoding="UTF-8"?>
<package schemaVersion="1.2" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>ArteryTek</vendor>
  <url></url>
  <name>AT32F421_DFP</name>
  <description>ArteryTek AT32F421 Series Device Support,Drivers</description>
  <releases>
    <release version="2.1.6" date="2024-04-03">
      Update for SFR file.
    </release>
    <release version="2.1.5" date="2024-01-26">
      Update firmware library.
    </release>
    <release version="2.1.4" date="2024-01-05">
      Update firmware library.
    </release>
    <release version="2.1.3" date="2023-10-26">
      Update firmware library and svd file.
    </release>
    <release version="2.1.2" date="2023-08-04">
      Update firmware library and svd file.
    </release>
    <release version="2.1.1" date="2023-02-16">
      Update firmware library.
    </release>
    <release version="2.1.0" date="2022-11-18">
      Add AT32F4212C8T7 chip type.
    </release>
    <release version="2.0.9" date="2022-10-28">
      Add AT32F4212C8T7 chip type.
    </release>
    <release version="2.0.8" date="2022-08-23">
      Update firmware library.
    </release>
    <release version="2.0.7" date="2022-06-29">
      Update firmware library.
    </release>
    <release version="2.0.6" date="2022-05-20">
      Update firmware library and svd file.
    </release>
  </releases>
  <keywords>
    <!-- keywords for indexing -->
    <keyword>ArteryTek</keyword>
    <keyword>AT32F421</keyword>
    <keyword>AT32F4</keyword>
  </keywords>

  <devices>
    <!-- ******************************  Cortex-M4  ********************** -->
    <family Dfamily="AT32F42x Series" Dvendor="ArteryTek:143">
      <!--book name="Device/ARM/Documents/??_dgug.pdf"       title="?? Device Generic Users Guide"/-->
    <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="1" Dmpu="1" Dtz="NO_TZ" Dendian="Little-endian" />
    <compile header="Device/Include/at32f421.h"/>

      <description>
AT32F4 is a new 32-bit high performance, low power consumption universal microcontroller family powered by the ARM Cortex-M4 RISC core,which targeted at various MCU application areas.
AT32F4 family integrates features to simplify system design and provide customers wide range of comprehensive and superior cost effective MCU portfolios with proven technology and great innovation.
      </description>    

      <!-- ************************  Subfamily 'AT32F421'  **************************** -->
      <subFamily DsubFamily="AT32F421">
      <processor  Dfpu="0" Dclock="120000000"/>
      <debug svd="SVD/AT32F421xx_v2.svd"/>
      <description>
AT32F421 - ARM Cortex-M4 Core
  Frequency up to 120 MHz
  Single-cycle multiplier and hardware divider
  NVIC support 16 internal, 28 external interrupts, each has 16 priority levels

Memories
  Flash size from 16KB up to 64KB
  SRAM size up to 16KB

Low power management
  Power saving mode: sleep,deep-sleep and standby mode

Advanced analog peripherals
  Up to 1 x 12bit ADC

Integrated peripherals interface
  Up to 2 x USART/UART/Irda/LIN/ISO7816
  Up to 2 x SPI
  Up to 2 x I2C

On-chip resources
  Up to 1 x 16 bit Advanced Timer, 1 x SysTick Timer, 5 x 16 bit GPTM, 2 x WDT, 1 x ERTC
  5-chs DMA support: Timers, ADC, SPIs, I2Cs, USARTs
  System supervisor and reset: POR,PDR,LVD
  80% GPIO available
  32-bit CRC, 96-bit unique ID
  On-chip clock: HICK (8MHz), LICK (40KHz)
      </description>

      <feature type="WDT"           n="2"/>
      <feature type="RTC"           n="32768"/>
      <feature type="ADC"           n="1"       m="12"/>
      <feature type="Temp"          n="-40"     m="105"/>
      <feature type="VCC"           n="2.40"    m="3.60"/>

        <!-- *************************  Device 'AT32F4212C8T7'  ***************************** -->
        <device Dname="-AT32F4212C8T7">
          <compile header="Device/Include/at32f421.h"  define="AT32F4212C8T7"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x10000"     startup="1"   default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x4000"      init   ="0"   default="1"/>
          <algorithm name="Flash/AT32F4212_64.FLM"                    start="0x08000000" size="0x10000"   default="1"/>
          <algorithm name="Flash/AT32F4212_BOOTMEM_AP.FLM"            start="0x1FFFE400" size="0x01000"   default="0"/>
          <algorithm name="Flash/AT32F4212_USD.FLM"                   start="0x1FFFF800" size="0x00040"   default="0"/>
        </device>

        <!-- *************************  Device 'AT32F421C8T7'  ***************************** -->
        <device Dname="-AT32F421C8T7">
          <compile header="Device/Include/at32f421.h"  define="AT32F421C8T7"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x10000"     startup="1"   default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x4000"      init   ="0"   default="1"/>
          <algorithm name="Flash/AT32F421_64.FLM"                     start="0x08000000" size="0x10000"   default="1"/>
          <algorithm name="Flash/AT32F421_BOOTMEM_AP.FLM"             start="0x1FFFE400" size="0x01000"   default="0"/>
          <algorithm name="Flash/AT32F421_USD.FLM"                    start="0x1FFFF800" size="0x00040"   default="0"/>
        </device>

        <!-- *************************  Device 'AT32F421C6T7'  ***************************** -->
        <device Dname="-AT32F421C6T7">
          <compile header="Device/Include/at32f421.h"  define="AT32F421C6T7"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x8000"      startup="1"   default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x4000"      init   ="0"   default="1"/>
          <algorithm name="Flash/AT32F421_32.FLM"                     start="0x08000000" size="0x8000"    default="1"/>
          <algorithm name="Flash/AT32F421_BOOTMEM_AP.FLM"             start="0x1FFFE400" size="0x01000"   default="0"/>
          <algorithm name="Flash/AT32F421_USD.FLM"                    start="0x1FFFF800" size="0x00040"   default="0"/>
        </device>

        <!-- *************************  Device 'AT32F421C4T7'  ***************************** -->
        <device Dname="-AT32F421C4T7">
          <compile header="Device/Include/at32f421.h"  define="AT32F421C4T7"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x4000"      startup="1"   default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x2000"      init   ="0"   default="1"/>
          <algorithm name="Flash/AT32F421_16.FLM"                     start="0x08000000" size="0x4000"    default="1"/>
          <algorithm name="Flash/AT32F421_BOOTMEM_AP.FLM"             start="0x1FFFE400" size="0x01000"   default="0"/>
          <algorithm name="Flash/AT32F421_USD.FLM"                    start="0x1FFFF800" size="0x00040"   default="0"/>
        </device>

        <!-- *************************  Device 'AT32F421K8T7'  ***************************** -->
        <device Dname="-AT32F421K8T7">
          <compile header="Device/Include/at32f421.h"  define="AT32F421K8T7"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x10000"     startup="1"   default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x4000"      init   ="0"   default="1"/>
          <algorithm name="Flash/AT32F421_64.FLM"                     start="0x08000000" size="0x10000"   default="1"/>
          <algorithm name="Flash/AT32F421_BOOTMEM_AP.FLM"             start="0x1FFFE400" size="0x01000"   default="0"/>
          <algorithm name="Flash/AT32F421_USD.FLM"                    start="0x1FFFF800" size="0x00040"   default="0"/>
        </device>

        <!-- *************************  Device 'AT32F421K6T7'  ***************************** -->
        <device Dname="-AT32F421K6T7">
          <compile header="Device/Include/at32f421.h"  define="AT32F421K6T7"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x8000"      startup="1"   default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x4000"      init   ="0"   default="1"/>
          <algorithm name="Flash/AT32F421_32.FLM"                     start="0x08000000" size="0x8000"    default="1"/>
          <algorithm name="Flash/AT32F421_BOOTMEM_AP.FLM"             start="0x1FFFE400" size="0x01000"   default="0"/>
          <algorithm name="Flash/AT32F421_USD.FLM"                    start="0x1FFFF800" size="0x00040"   default="0"/>
        </device>

        <!-- *************************  Device 'AT32F421K4T7'  ***************************** -->
        <device Dname="-AT32F421K4T7">
          <compile header="Device/Include/at32f421.h"  define="AT32F421K4T7"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x4000"      startup="1"   default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x2000"      init   ="0"   default="1"/>
          <algorithm name="Flash/AT32F421_16.FLM"                     start="0x08000000" size="0x4000"    default="1"/>
          <algorithm name="Flash/AT32F421_BOOTMEM_AP.FLM"             start="0x1FFFE400" size="0x01000"   default="0"/>
          <algorithm name="Flash/AT32F421_USD.FLM"                    start="0x1FFFF800" size="0x00040"   default="0"/>
        </device>

        <!-- *************************  Device 'AT32F421K8U7'  ***************************** -->
        <device Dname="-AT32F421K8U7">
          <compile header="Device/Include/at32f421.h"  define="AT32F421K8U7"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x10000"     startup="1"   default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x4000"      init   ="0"   default="1"/>
          <algorithm name="Flash/AT32F421_64.FLM"                     start="0x08000000" size="0x10000"   default="1"/>
          <algorithm name="Flash/AT32F421_BOOTMEM_AP.FLM"             start="0x1FFFE400" size="0x01000"   default="0"/>
          <algorithm name="Flash/AT32F421_USD.FLM"                    start="0x1FFFF800" size="0x00040"   default="0"/>
        </device>

        <!-- *************************  Device 'AT32F421K6U7'  ***************************** -->
        <device Dname="-AT32F421K6U7">
          <compile header="Device/Include/at32f421.h"  define="AT32F421K6U7"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x8000"      startup="1"   default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x4000"      init   ="0"   default="1"/>
          <algorithm name="Flash/AT32F421_32.FLM"                     start="0x08000000" size="0x8000"    default="1"/>
          <algorithm name="Flash/AT32F421_BOOTMEM_AP.FLM"             start="0x1FFFE400" size="0x01000"   default="0"/>
          <algorithm name="Flash/AT32F421_USD.FLM"                    start="0x1FFFF800" size="0x00040"   default="0"/>
        </device>

        <!-- *************************  Device 'AT32F421K4U7'  ***************************** -->
        <device Dname="-AT32F421K4U7">
          <compile header="Device/Include/at32f421.h"  define="AT32F421K4U7"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x4000"      startup="1"   default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x2000"      init   ="0"   default="1"/>
          <algorithm name="Flash/AT32F421_16.FLM"                     start="0x08000000" size="0x4000"    default="1"/>
          <algorithm name="Flash/AT32F421_BOOTMEM_AP.FLM"             start="0x1FFFE400" size="0x01000"   default="0"/>
          <algorithm name="Flash/AT32F421_USD.FLM"                    start="0x1FFFF800" size="0x00040"   default="0"/>
        </device>

        <!-- *************************  Device 'AT32F421K8U7-4'  ***************************** -->
        <device Dname="-AT32F421K8U7-4">
          <compile header="Device/Include/at32f421.h"  define="AT32F421K8U7_4"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x10000"     startup="1"   default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x4000"      init   ="0"   default="1"/>
          <algorithm name="Flash/AT32F421_64.FLM"                     start="0x08000000" size="0x10000"   default="1"/>
          <algorithm name="Flash/AT32F421_BOOTMEM_AP.FLM"             start="0x1FFFE400" size="0x01000"   default="0"/>
          <algorithm name="Flash/AT32F421_USD.FLM"                    start="0x1FFFF800" size="0x00040"   default="0"/>
        </device>

