xizeyoupan/AT32F421K8T7-EIDE-template/.pack/ArteryTek/AT32F421_DFP.2.1.6/ArteryTek.AT32F421_DFP.pdsc
        <!-- *************************  Device 'AT32F421K6U7-4'  ***************************** -->
        <device Dname="-AT32F421K6U7-4">
          <compile header="Device/Include/at32f421.h"  define="AT32F421K6U7_4"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x8000"      startup="1"   default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x4000"      init   ="0"   default="1"/>
          <algorithm name="Flash/AT32F421_32.FLM"                     start="0x08000000" size="0x8000"    default="1"/>
          <algorithm name="Flash/AT32F421_BOOTMEM_AP.FLM"             start="0x1FFFE400" size="0x01000"   default="0"/>
          <algorithm name="Flash/AT32F421_USD.FLM"                    start="0x1FFFF800" size="0x00040"   default="0"/>
        </device>

        <!-- *************************  Device 'AT32F421K4U7-4'  ***************************** -->
        <device Dname="-AT32F421K4U7-4">
          <compile header="Device/Include/at32f421.h"  define="AT32F421K4U7_4"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x4000"      startup="1"   default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x2000"      init   ="0"   default="1"/>
          <algorithm name="Flash/AT32F421_16.FLM"                     start="0x08000000" size="0x4000"    default="1"/>
          <algorithm name="Flash/AT32F421_BOOTMEM_AP.FLM"             start="0x1FFFE400" size="0x01000"   default="0"/>
          <algorithm name="Flash/AT32F421_USD.FLM"                    start="0x1FFFF800" size="0x00040"   default="0"/>
        </device>

        <!-- *************************  Device 'AT32F421F8P7'  ***************************** -->
        <device Dname="-AT32F421F8P7">
          <compile header="Device/Include/at32f421.h"  define="AT32F421F8P7"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x10000"     startup="1"   default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x4000"      init   ="0"   default="1"/>
          <algorithm name="Flash/AT32F421_64.FLM"                     start="0x08000000" size="0x10000"   default="1"/>
          <algorithm name="Flash/AT32F421_BOOTMEM_AP.FLM"             start="0x1FFFE400" size="0x01000"   default="0"/>
          <algorithm name="Flash/AT32F421_USD.FLM"                    start="0x1FFFF800" size="0x00040"   default="0"/>
        </device>

        <!-- *************************  Device 'AT32F421F6P7'  ***************************** -->
        <device Dname="-AT32F421F6P7">
          <compile header="Device/Include/at32f421.h"  define="AT32F421F6P7"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x8000"      startup="1"   default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x4000"      init   ="0"   default="1"/>
          <algorithm name="Flash/AT32F421_32.FLM"                     start="0x08000000" size="0x8000"    default="1"/>
          <algorithm name="Flash/AT32F421_BOOTMEM_AP.FLM"             start="0x1FFFE400" size="0x01000"   default="0"/>
          <algorithm name="Flash/AT32F421_USD.FLM"                    start="0x1FFFF800" size="0x00040"   default="0"/>
        </device>

        <!-- *************************  Device 'AT32F421F4P7'  ***************************** -->
        <device Dname="-AT32F421F4P7">
          <compile header="Device/Include/at32f421.h"  define="AT32F421F4P7"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x4000"      startup="1"   default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x2000"      init   ="0"   default="1"/>
          <algorithm name="Flash/AT32F421_16.FLM"                     start="0x08000000" size="0x4000"    default="1"/>
          <algorithm name="Flash/AT32F421_BOOTMEM_AP.FLM"             start="0x1FFFE400" size="0x01000"   default="0"/>
          <algorithm name="Flash/AT32F421_USD.FLM"                    start="0x1FFFF800" size="0x00040"   default="0"/>
        </device>

        <!-- *************************  Device 'AT32F421F8U7'  ***************************** -->
        <device Dname="-AT32F421F8U7">
          <compile header="Device/Include/at32f421.h"  define="AT32F421F8U7"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x10000"     startup="1"   default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x4000"      init   ="0"   default="1"/>
          <algorithm name="Flash/AT32F421_64.FLM"                     start="0x08000000" size="0x10000"   default="1"/>
          <algorithm name="Flash/AT32F421_BOOTMEM_AP.FLM"             start="0x1FFFE400" size="0x01000"   default="0"/>
          <algorithm name="Flash/AT32F421_USD.FLM"                    start="0x1FFFF800" size="0x00040"   default="0"/>
        </device>

        <!-- *************************  Device 'AT32F421F6U7'  ***************************** -->
        <device Dname="-AT32F421F6U7">
          <compile header="Device/Include/at32f421.h"  define="AT32F421F6U7"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x8000"      startup="1"   default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x4000"      init   ="0"   default="1"/>
          <algorithm name="Flash/AT32F421_32.FLM"                     start="0x08000000" size="0x8000"    default="1"/>
          <algorithm name="Flash/AT32F421_BOOTMEM_AP.FLM"             start="0x1FFFE400" size="0x01000"   default="0"/>
          <algorithm name="Flash/AT32F421_USD.FLM"                    start="0x1FFFF800" size="0x00040"   default="0"/>
        </device>

        <!-- *************************  Device 'AT32F421F4U7'  ***************************** -->
        <device Dname="-AT32F421F4U7">
          <compile header="Device/Include/at32f421.h"  define="AT32F421F4U7"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x4000"      startup="1"   default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x2000"      init   ="0"   default="1"/>
          <algorithm name="Flash/AT32F421_16.FLM"                     start="0x08000000" size="0x4000"    default="1"/>
          <algorithm name="Flash/AT32F421_BOOTMEM_AP.FLM"             start="0x1FFFE400" size="0x01000"   default="0"/>
          <algorithm name="Flash/AT32F421_USD.FLM"                    start="0x1FFFF800" size="0x00040"   default="0"/>
        </device>

        <!-- *************************  Device 'AT32F421G8U7'  ***************************** -->
        <device Dname="-AT32F421G8U7">
          <compile header="Device/Include/at32f421.h"  define="AT32F421G8U7"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x10000"     startup="1"   default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x4000"      init   ="0"   default="1"/>
          <algorithm name="Flash/AT32F421_64.FLM"                     start="0x08000000" size="0x10000"   default="1"/>
          <algorithm name="Flash/AT32F421_BOOTMEM_AP.FLM"             start="0x1FFFE400" size="0x01000"   default="0"/>
          <algorithm name="Flash/AT32F421_USD.FLM"                    start="0x1FFFF800" size="0x00040"   default="0"/>
        </device>

        <!-- *************************  Device 'AT32F421G6U7'  ***************************** -->
        <device Dname="-AT32F421G6U7">
          <compile header="Device/Include/at32f421.h"  define="AT32F421G6U7"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x8000"      startup="1"   default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x4000"      init   ="0"   default="1"/>
          <algorithm name="Flash/AT32F421_32.FLM"                     start="0x08000000" size="0x8000"    default="1"/>
          <algorithm name="Flash/AT32F421_BOOTMEM_AP.FLM"             start="0x1FFFE400" size="0x01000"   default="0"/>
          <algorithm name="Flash/AT32F421_USD.FLM"                    start="0x1FFFF800" size="0x00040"   default="0"/>
        </device>

        <!-- *************************  Device 'AT32F421G4U7'  ***************************** -->
        <device Dname="-AT32F421G4U7">
          <compile header="Device/Include/at32f421.h"  define="AT32F421G4U7"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x4000"      startup="1"   default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x2000"      init   ="0"   default="1"/>
          <algorithm name="Flash/AT32F421_16.FLM"                     start="0x08000000" size="0x4000"    default="1"/>
          <algorithm name="Flash/AT32F421_BOOTMEM_AP.FLM"             start="0x1FFFE400" size="0x01000"   default="0"/>
          <algorithm name="Flash/AT32F421_USD.FLM"                    start="0x1FFFF800" size="0x00040"   default="0"/>
        </device>

        <!-- *************************  Device 'AT32F421PF8P7'  ***************************** -->
        <device Dname="-AT32F421PF8P7">
          <compile header="Device/Include/at32f421.h"  define="AT32F421PF8P7"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x10000"     startup="1"   default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x4000"      init   ="0"   default="1"/>
          <algorithm name="Flash/AT32F421_64.FLM"                     start="0x08000000" size="0x10000"   default="1"/>
          <algorithm name="Flash/AT32F421_BOOTMEM_AP.FLM"             start="0x1FFFE400" size="0x01000"   default="0"/>
          <algorithm name="Flash/AT32F421_USD.FLM"                    start="0x1FFFF800" size="0x00040"   default="0"/>
        </device>

        <!-- *************************  Device 'AT32F421PF4P7'  ***************************** -->
        <device Dname="-AT32F421PF4P7">
          <compile header="Device/Include/at32f421.h"  define="AT32F421PF4P7"/>
          <memory id="IROM1"  access="rx"       start="0x08000000"  size="0x4000"      startup="1"   default="1"/>
          <memory id="IRAM1"  access="rw"       start="0x20000000"  size="0x2000"      init   ="0"   default="1"/>
          <algorithm name="Flash/AT32F421_16.FLM"                     start="0x08000000" size="0x4000"    default="1"/>
          <algorithm name="Flash/AT32F421_BOOTMEM_AP.FLM"             start="0x1FFFE400" size="0x01000"   default="0"/>
          <algorithm name="Flash/AT32F421_USD.FLM"                    start="0x1FFFF800" size="0x00040"   default="0"/>
        </device>

     </subFamily>

    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>

    <!-- Device Conditions -->
    <condition id="AT32F421xx">
      <description>ArteryTek AT32F421 Devices</description>
      <require Dvendor="ArteryTek:143" Dname="-AT32F421[2CFGK]*"/>
      <require Cclass="Device" Cgroup="Startup" />
    </condition>

