xizeyoupan/AT32F421K8T7-EIDE-template/.pack/ArteryTek/AT32F421_DFP.2.1.6/ArteryTek.AT32F421_DFP.pdsc
    <condition id="AT32F421">
      <description>ArteryTek AT32F421 Devices</description>
      <accept condition="AT32F421xx"/>
    </condition>

    <!-- Series id Conditions -->
    <condition id="AT32F421xx ARMCC">
      <description>ArteryTek AT32F421xx Series devices</description>
      <require Dvendor="ArteryTek:143" Dname="-AT32F421[2CFGK]*"/>
      <require condition="Compiler ARMCC"/>
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="AT32F421 CMSIS">
      <description>ArteryTek AT32F421 Devices and CMSIS-CORE</description>
      <require condition="AT32F421"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="at32f421_conf"/>    
      <require Cclass="Device" Cgroup="at32f421_firmware_library" Csub="crm"/>           
    </condition>

    <!-- AT32F421 STDPERIPHERALS CRM Conditions -->
    <condition id="AT32F421 STDPERIPHERALS CRM">
      <description>ArteryTek AT32F421 Standard Peripherals Drivers with CRM</description>
      <require condition="AT32F421 CMSIS"/>
      <require Cclass="Device" Cgroup="at32f421_firmware_library" Csub="crm"/>
    </condition>

     <!-- AT32F421 STDPERIPHERALS MISC Conditions -->
    <condition id="AT32F421 STDPERIPHERALS MISC">
      <description>ArteryTek  AT32F421 Standard Peripherals Drivers with MISC</description>
      <require condition="AT32F421 CMSIS"/>
      <require Cclass="Device" Cgroup="at32f421_firmware_library" Csub="misc"/>
    </condition>

     <!-- AT32F421 STDPERIPHERALS EVAL Conditions -->
    <condition id="AT32F421 STDPERIPHERALS EVB">
      <description>ArteryTek AT32F421 Standard Peripherals Drivers with EVB</description>
      <require condition="AT32F421 CMSIS"/>
      <require Cclass="Device" Cgroup="at32f421_firmware_library" Csub="gpio"/>
      <require Cclass="Device" Cgroup="at32f421_firmware_library" Csub="exint"/>
      <require Cclass="Device" Cgroup="at32f421_firmware_library" Csub="usart"/>
    </condition>
  </conditions>

  <components>
  <!-- at32f421_firmware_library -->

    <component Cclass="Device" Cgroup="at32f421_firmware_library" Csub="adc" Cversion="2.0.0" condition="AT32F421 STDPERIPHERALS CRM">
      <description>Analog-to-digital converter (ADC) driver for AT32F421 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_ADC
        </RTE_Components_h>
        <files>
          <!-- ADC file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f421_adc.h"/>
          <file category="source" name="Device/Firmware/Peripherals/src/at32f421_adc.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="at32f421_firmware_library" Csub="cmp" Cversion="2.0.0" condition="AT32F421 STDPERIPHERALS CRM">
      <description>Comparator (CMP) driver for AT32F421 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_CMP
        </RTE_Components_h>
        <files>
          <!-- CMP file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f421_cmp.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/at32f421_cmp.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="at32f421_firmware_library" Csub="crc" Cversion="2.0.0" condition="AT32F421 STDPERIPHERALS CRM">
      <description>Cyclic Redundancy Check (CRC) driver for AT32F421 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_CRC
        </RTE_Components_h>
        <files>
          <!-- CRC file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f421_crc.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/at32f421_crc.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="at32f421_firmware_library" Csub="crm" Cversion="2.0.0" condition="AT32F421 STDPERIPHERALS MISC">
      <description>Clock and Reset Management (CRM) driver for AT32F421 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_CRM
        </RTE_Components_h>
        <files>
          <!-- CRM file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f421_crm.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/at32f421_crm.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="at32f421_firmware_library" Csub="debug" Cversion="2.0.0" condition="AT32F421 STDPERIPHERALS CRM">
      <description>Debug (DEBUG) driver for AT32F421 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_DEBUG
        </RTE_Components_h>
        <files>
          <!-- DEBUG file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f421_debug.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/at32f421_debug.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="at32f421_firmware_library" Csub="dma" Cversion="2.0.0" condition="AT32F421 STDPERIPHERALS CRM">
      <description>Direct Memory Access (DMA) driver for AT32F421 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_DMA
        </RTE_Components_h>
        <files>
          <!-- DMA file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f421_dma.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/at32f421_dma.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="at32f421_firmware_library" Csub="ertc" Cversion="2.0.0" condition="AT32F421 STDPERIPHERALS CRM">
      <description>Enhance Real-time Clock (ERTC) driver for AT32F421 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_ERTC
        </RTE_Components_h>
        <files>
          <!-- ERTC file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f421_ertc.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/at32f421_ertc.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="at32f421_firmware_library" Csub="exint" Cversion="2.0.0" condition="AT32F421 STDPERIPHERALS CRM">
      <description>External Interrupt/Event (EXINT) driver for AT32F421 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_EXINT
        </RTE_Components_h>
        <files>
          <!-- EXINT file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f421_exint.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/at32f421_exint.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="at32f421_firmware_library" Csub="flash" Cversion="2.0.0" condition="AT32F421 STDPERIPHERALS CRM">
      <description>Flash Memory Controller (FLASH) driver for AT32F421 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_FLASH
        </RTE_Components_h>
        <files>
          <!-- FLASH file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f421_flash.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/at32f421_flash.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="at32f421_firmware_library" Csub="gpio" Cversion="2.0.0" condition="AT32F421 STDPERIPHERALS CRM">
      <description>General-purpose and Alternate-function I/Os (GPIO) driver for AT32F421 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_GPIO
        </RTE_Components_h>
        <files>
          <!-- GPIO file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f421_gpio.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/at32f421_gpio.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="at32f421_firmware_library" Csub="i2c" Cversion="2.0.0" condition="AT32F421 STDPERIPHERALS CRM">
      <description>Inter-integrated Circuit (I2C) driver for AT32F421 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_I2C
        </RTE_Components_h>
        <files>
          <!-- I2C file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f421_i2c.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/at32f421_i2c.c" attr="config" version="2.0.0" />
        </files>
    </component>

