xizeyoupan/AT32F421K8T7-EIDE-template/.pack/ArteryTek/AT32F421_DFP.2.1.6/ArteryTek.AT32F421_DFP.pdsc
    <component Cclass="Device" Cgroup="at32f421_firmware_library" Csub="misc" Cversion="2.0.0" condition="AT32F421 CMSIS">
      <description>MISC driver for AT32F421 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_MISC
        </RTE_Components_h>
        <files>
          <!-- MISC file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f421_misc.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/at32f421_misc.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="at32f421_firmware_library" Csub="pwc" Cversion="2.0.0" condition="AT32F421 STDPERIPHERALS CRM">
      <description>Power Control Unit(PWC) driver for AT32F421 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_PWC
        </RTE_Components_h>
        <files>
          <!-- PWC file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f421_pwc.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/at32f421_pwc.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="at32f421_firmware_library" Csub="scfg" Cversion="2.0.0" condition="AT32F421 STDPERIPHERALS CRM">
      <description>System config (SCFG) driver for AT32F421 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_SCFG
        </RTE_Components_h>
        <files>
          <!-- SCFG file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f421_scfg.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/at32f421_scfg.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="at32f421_firmware_library" Csub="spi" Cversion="2.0.0" condition="AT32F421 STDPERIPHERALS CRM">
      <description>Serial Peripheral Interface / Inter-IC Sound (SPI) driver for AT32F421 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_SPI
        </RTE_Components_h>
        <files>
          <!-- SPI file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f421_spi.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/at32f421_spi.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="at32f421_firmware_library" Csub="tmr" Cversion="2.0.0" condition="AT32F421 STDPERIPHERALS CRM">
      <description>TIMER driver for AT32F421 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_TMR
        </RTE_Components_h>
        <files>
          <!-- TIMER file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f421_tmr.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/at32f421_tmr.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="at32f421_firmware_library" Csub="usart" Cversion="2.0.0" condition="AT32F421 STDPERIPHERALS CRM">
      <description>Universal Synchronous Asynchronous Receiver Transmitter (USART) driver for AT32F421 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_USART
        </RTE_Components_h>
        <files>
          <!-- USART file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f421_usart.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/at32f421_usart.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="at32f421_firmware_library" Csub="wdt" Cversion="2.0.0" condition="AT32F421 STDPERIPHERALS CRM">
      <description>watchdog timer(WDT) driver for AT32F421 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_WDT
        </RTE_Components_h>
        <files>
          <!-- WDT file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f421_wdt.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/at32f421_wdt.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="at32f421_firmware_library" Csub="wwdt" Cversion="2.0.0" condition="AT32F421 STDPERIPHERALS CRM">
      <description>Window Watchdog Timer (WWDT) driver for AT32F421 Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_WWDT
        </RTE_Components_h>
        <files>
          <!-- WWDT file -->
          <file category="header" name="Device/Firmware/Peripherals/inc/at32f421_wwdt.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/at32f421_wwdt.c" attr="config" version="2.0.0" />
        </files>
    </component>

    <!-- Utilities AT32F421 -->
    <component Cclass="Device" Cgroup="evb" Csub="at-start-f421" Cversion="2.0.0" condition="AT32F421 STDPERIPHERALS EVB">
      <description>Firmware functions to manage Leds, Keys, COM ports</description>
      <files>
        <!-- include folder -->
        <file category="header" name="Device/Utilities/at32f421_board.h" />
        <!-- evb file -->
        <file category="source" name="Device/Utilities/at32f421_board.c" attr="config" version="2.0.0"/>
      </files>
    </component>

    <!-- Config AT32F421 -->
    <component Cclass="Device" Cgroup="at32f421_conf" Cversion="2.0.0" condition="AT32F421 CMSIS">
      <description>Configuration file</description>
      <files>
        <!-- include folder -->
        <file category="header" name="Device/Include/at32f421_conf.h" attr="config" version="2.0.0"/>
      </files>
    </component>

   <!-- Startup AT32F421  -->
    <component Cclass="Device" Cgroup="Startup"   Cversion="2.0.0" condition="AT32F421">
      <description>System Startup for ArteryTek AT32F421  Devices</description>
      <files>
        <!-- include folder -->
        <file category="include" name="Device/Include/"/>
        <file category="header" name="Device/Include/at32f421.h"/>
        <!-- startup file -->
        <file category="source" name="Device/Source/ARM/startup_at32f421.s" attr="config" version="2.0.0" condition="AT32F421xx ARMCC"/>
        <!-- system file -->
        <file category="source" name="Device/Source/system_at32f421.c"      attr="config" version="2.0.0"/>
      </files>
    </component>
  </components>
</package>
